{   "blogposts": [
    {
        "id": "11059017",
        "title": "Week 11",
        "subtitle": "A Real Team",
        "date": "November 12, 2017",
        "content": [
            {
                "title": "What did you do this past week?",
                "body": "IDB 3! We spent the past weekend and early week putting in a ton of time on gamingdb. I spent most of my working on search on the frontend, but also putting in a decent amount of time to styling sorting/filtering and improving upon some problems we had in the site after part 2. One of the big things I wanted to fix was having routing history on our pagination, so when you used the browser back button after clicking on a game or paging, it would take you to where you actually were before, rather than the first page. Search for the page was a big beast though that took most of my time. Specifically since it had so many moving parts. Search was a bit complex as a request due to how it was implemented on the back end, which was tough, but it also required the list display, tabbing over the different models, and paging within each of the model sets. Oh and also highlighting the text from all of the models and displaying them in a meaningful way was more complex than I felt it would be at the beginning of the project."
            },
            {
                "title": "What's in your way?",
                "body": "Big projects are piling up at this point of the semester, so balancing when to work on what is tough. I had a big IR project at the same time as IDB 3, while also in the middle of my large project at IBM. Each of them are very different and require a different mindset and can be hard to work on in parallel. Also I have 2 different groups to meet up with for different projects so planning often has to be a sacrafice of free-time or breaking into the other projects 'time'"
            },
            {
                "title": "What will you do next week?",
                "body": "I have to finish up and turn in my PageRank project for IR and give my next project playback at IBM. Once both of those are done I'll be able to slip into a bit of a more normal routine."
            },
            {
                "title": "What's my experience of the class?",
                "body": "Right now I am not enjoying it that much. I wouldn't say its because of the content but because of how it is all presented. Python and Regex and OO principals have been topics I already have knowledge in so if the teaching style hasn't really changed and I'm only noticing it now its because SQL is actually more new to me, especially the more advanced nuances. What I am talking about is that class is just a presentation of examples. I feel like we never get a good description of actual features of SQL we are just shown a bunch of seemingly contrived examples and expected to learn something important about SQL. I don't feel like I ever have the opportunity to reflect in class about how I personally would use a 'feature' of SQL and actually have complex thoughts about it. I wish we were given the chance to learn about WHY we do certain things not just being shown how it is done in one or two examples. Also I think this is heightened because the examples feel really disjoint since we also have to have knowledge of all of the tables, so much of the limited time we have between examples is spent wondering why you used the Apply table or whatever. I usually really enjoy coming to this class and learning, but I have had a really hard time recently."
            },
            {
                "title": "What's my pick-of-the-week or tip-of-the-week?",
                "body": "I'm a strong believer that productivity tools are really valuable to developers, whether this is build in editor tools, IDE's, shortcut keys, or whatever. One of my favorite things is the a visor mode terminal. This makes it to where you can 'summon' your terminal anytime on your computer with a shortcut. I use iterm2, where I have a secondary profile called 'visor' that has a shortcut key Alt + Space that allows it to appear from the top of my screen over any windows, and then disappears when I click away or use the hotkey again. It is really valuable to me when I am running scripts often through the commandline, since I don't have to have it fullscreened and swipe over to it or search through my open apps. There are lots of terminals that have this feature and great guides on how to get them set up!"
            }
        ]
    },
        {
            "id": "11059017",
            "title": "Week 10",
            "subtitle": "Nitty Gritty",
            "date": "November 5, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week I started ideation and planning for my upcoming BDP project proposal, I have had an idea for a long time but I started getting it on paper. I also registered for my last semester of classes; I have Cloud Computing and Intro to Computer Security on my schedule now with a hopeless looking waitlist for Ethical Hacking. I also had an on-campus interview with Arista that went really well and I moving forward to the 2nd round with them."
                },
                {
                    "title": "What's in your way?",
                    "body": "Pure exhaustion. Recently I think all of my tiredness of the year is compounding and surmounting to just a constant dull tired. Having intensive courses this semester along with personal life seeming to get in the way at the busiest of times, I am having trouble breaking the cycle of tiredness."
                },
                {
                    "title": "What will you do next week?",
                    "body": "This upcoming week will be spent finishing IDB part 3 working on implementing search for me mostly. I also have an Information Retrieval project on implementing PageRank that I need to work on."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "Class is still interesting, I certainly don't enjoy SQL as much as I did the ins-and-outs of Python, but it is by no means bad in any way, just alittle less my style than before. It feels like much more of the class takes place outside of the class these days, to where class time feels secondary to the project. I think this is probably since (especially for me working mostly in the frontend) the material is so detached from what I am doing that it can feel disjoint."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip of the week is to find the people who make the tools/languages/frameworks/etc that you use on a daily or weekly basis and follow them on social media. My Twitter account is almost entirely developers nowadays and it is a great way to keep myself engaged in the development community and to hear about new things & the development of my favorite technologies. Many of these people are very vocal and active and will give you insight or make you think about parts of development or stacks that you don't often think about. It also makes browsing social media feel more substantial than looking at memes your friends posted."
                }
            ]
        },
        {
            "id": "10229017",
            "title": "Week 9",
            "subtitle": "A Real Website",
            "date": "October 29, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "We finished IDB part 2! Our webiste is now functional and looks great. Working on finishing up IDB took up most of the week but I also had a test in another class that wasn't very bad. I am getting to the point where I feel pretty confident using react. I can't say I'm a huge fan of the syntax of the language, espcially when writing code in the JSX, but thats only when I am comparing it to frameworks I like more, overall I am enjoying the project/"
                },
                {
                    "title": "What's in your way?",
                    "body": "Job hunting is and has been in my way for too long. It takes so much energy and focus away from my school work, and I can't wait for it to be over."
                },
                {
                    "title": "What will you do next week?",
                    "body": "In this upcoming week I am going to start working on the next portion of IDB along with other homework, including beginning to prototype solutions for my IBM class project."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "Right now I would say its a high coming off of IDB 2. I think it was FAR more valuable to work on with React over the static front-end and data. I think it would have been so much better if we hadn't started out with that. My experience with the project and my team has been great, and it is a good feeling to have so much ownership and pride in a school project."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "Add small animations into your IDB website. I know CSS can be daunting and confusing at the start but there are a ton of great resources and pre-existing styles out there. So taking the time to add in just tiny little animations, whether it is a growing on hover or color change or loading bar, animation gives the user so much more feedback on their acitons. It is one of the smallest things you can do to transform your site from a patched together project to a polished portfolio piece."
                }
            ]
        },
        {
            "id": "10222017",
            "title": "Week 8",
            "subtitle": "Halfway",
            "date": "October 22, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week was crazy for me. It started with spending Tuesday under anethesia for a medical prodcedure I had to get, then I had my midterm in Information Retrieval course, which was challenging but I think went pretty well. Then right after my test I came home and packed and left to Seattle for an Interview at Amazon. It was my first time in Seattle which was exciting. I had a great time while there, I got to visit Pikes Place and get some great seafood down by the bay after my interview. I also started working on the React front-end of idb this week during all of that."
                },
                {
                    "title": "What's in your way?",
                    "body": "Recovering from a long tough week that really messed with my schedule. Weeks like this where I miss a lot of class and spend a bunch of time indisposed take some mental recovery to get back into the swing of my traditional schedule."
                },
                {
                    "title": "What will you do next week?",
                    "body": "This next week will be heavily focused on finishing up and polishing idb. I also have some orientation stuff to do with my org for some new leadership we are bringing in, which will be exciting."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "Working on idb has felt like a small part-time job. Actually having to meet and plan out work feels reminiscant of actual agile processes albeit much more casual. Learning React has been quite a journey for me, it feels so different than the other frameworks I have worked with. Much of the syntax feels pretty odd for me."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip is specifically related to idb. Since we should start having very polished looking websites I think it would be good to give a quick tip on how to improve user experience overall. One really simple thing you can do to improve your websites interface is to add whitespace. White space isn't just actual 'white' space, but parts of the page that are completely devoid of any type of information. When you increase your whitespace you typcially will increase readability and declutter the visual space. Especially in a project like this one where we are required to display a lot of information if you try to cram all of that information together your user will not be able to quickly parse the information or find what is valuable. Certainly this tip is not a 'catch-all' and you shouldn't just immense white space for no reason, but if you are looking at your content and it feels like it needs something to look better, try adding some extra white space and that may be a quick way to improve it. (P.S. Do NOT use images as backgrounds, this is really distracting and makes text and components really hard to decypher)"
                }
            ]
        },
        {
            "id": "10152017",
            "title": "Week 7",
            "subtitle": "Examination Complete",
            "date": "October 15, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week was highlighted by the test! While it was certainly not the only important thing (even that day), I also had an Information Retrieval project due that morning, and a Lithium technologies interview a few hours before hand. Luckily a lot of the studying I do for Downings tests translate well into technical interviews. I felt it went really well, it was only one fairly simple programming problem that I finished in a little less than 15 minutes of the hour long interview. My Information Retrieval project was very interesting, the projects always give me some worry on completion though because I can never make it to office hours and I don't really know anyone in the class so I am truly muscling through them on my own."
                },
                {
                    "title": "What's in your way?",
                    "body": "I feel like the next big thing for me is the SWE project, the next portion is really large and we haven't made any real headway on it. There have been alot of other things imposing on my ability to focus and find time to meet with the group, like the test, other projects and group work in my other classes, and org business."
                },
                {
                    "title": "What will you do next week?",
                    "body": "Next week might actually end up being my most stressful week this year. It starts with a normal Monday, but on Tuesday I have a doctors appointment to get an ECG (electrogastrogram) which will probably take me out of commision for the day. Following that I have a research playback at IBM for my radical collaboration course in which I have not been able to heavily participate in due to my hectic schedule. And then on Thursday I have a midterm in Information Retrieval. It's the only midterm, which always worries me since you have no chance to improve on a second one given the layout of the test. I will also be missing a test prep/review class period due to my hence mentioned doctors visit. AND THEN after that I will have to run to the airport to fly to Seattle for an onsite Amazon interview. I'm pretty stoked to visit Seattle for the first time and looking forward to the interview, but its stressful when it come after all of that."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "Overall quite good. The test felt easy enough given my prep and it felt good coding on Hackerrank rather than Canvas like we used to in OOP. I will admit I spent most of my time trying to remember how to get the decimal numbers from an integer (an embarrasingly long time), but other than that I felt I did very well."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "Spend time finding things that really excite you about computer science. I think we are all really lucky to be in a major and career field that has such a wide reach. I don't really understand how people in other majors are able to make it through their classes without having something about it that they really really enjoy. For me I find my CS specific classes so interesting, but more than that the knowledge I gain from them opens up a world for me to find even more interesting things than are offered here. One thing I find really fascinating is the ability to use code to visually express complex ideas. This past week I discovered a guy who made vizualizations of repetition in songs using self-similarity matrices. You can check them out at this address -> https://colinmorris.github.io/SongSim/ <-. Being able to just go out on the internet and find so many people doing such neat and interesting things simply because they enjoy programming and making little discoveries is why I love CS so much."
                }
            ]
        },
        {
            "id": "10082017",
            "title": "Week 6",
            "subtitle": "Testing... testing...",
            "date": "October 8, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week I spent most of my time working on other classwork, trying to get a bit ahead in other things so our team could meet up and start powering through the next project (and studying for the test)."
                },
                {
                    "title": "What's in your way?",
                    "body": "I have been doing a lot of work for my org in terms of recruiting leadership. This has been a big time commitment for me and has been blocking a lot of my school work. We concluded 'interviews' this weekend so hopefully we can get it all wrapped up shortly!"
                },
                {
                    "title": "What will you do next week?",
                    "body": "The upcoming week is a BIG one. We of course have the SWE test which I will be spending a large amount of time preparing for. I also have a meeting with a recruiter from my past internship about a return offer, and then an interview with Lithium the following day. So alongside studying I will be prepping for the interview. I also have an information retrieval project that I am finishing up with experiments and testing."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "After the project ending I actually find myself looking forward to the next parts of it. I have been watching videos and learning about react on my own to prepare for architecting the applications front-end. This project is really well done and inspires collaboration and creativity, something that group projects in college really miss. I would say I wish the big topics on the project were covered even generally."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip of the week is to break everything down into the smallest pieces. In web particularly this is known as 'Atomic Design'. This is a design pattern that involves creating the smallest parts of your component structure 'atoms' and building up from there to 'molecules', and 'organisms'. This kind of design pattern makes building new components easier for you and for others on the project. Basically its like making legos out of your application, a bunch of little building blocks that you can use later on to build cool things. If you aren't convinced heres a link with 10 reasons you too should use Atomic Design -- http://www.creativebloq.com/web-design/10-reasons-you-should-be-using-atomic-design-61620771"
                }
            ]
        },
        {
            "id": "10022017",
            "title": "Week 5",
            "subtitle": "Dynamic SPA",
            "date": "October 2, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week I spent most of my time working to finish up the idb project. Making sure everything about the initial site was 'perfect' and up to my standards. I also had and Information Retrieval project due on the same day so balancing the work load between the two."
                },
                {
                    "title": "What's in your way?",
                    "body": "Right now my schedule feels really free since almost all of my classes just restarted in some sense. So I need to pump the gas and get started on my next round of projects/tests."
                },
                {
                    "title": "What will you do next week?",
                    "body": "In this upcoming week I am going to dive headfirst into all of my new projects. I am really excited to get started on working with React. I have been watching videos to prepare and even started writing some of the atomic components of the application."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "This class has by far the best turn-in for coding projects. I can't stand turning in a zipped file full of code that all has to be named something really specific, where you are always uncertain if you turned in the right files. By letting us turn in through github and basically only turning in a 'link' to canvas it makes handling the codebase more natural. Nothing in the real world gets turned in, but it does get PR'ed and reviewed."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip of the week is to check out Academind on Youtube. He is always my first stop for learning the basics of new web technologies. I think he explains things really well and actually covers good use cases. Finding the right person to explain things can be really important, and when so many good resources exist its great to have a place to start. If you have anyone else you love for webdev tools let me know!"
                }
            ]
        },
        {
            "id": "09242017",
            "title": "Week 4",
            "subtitle": "Welcome to Gamingdb",
            "date": "September 24, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week I got started on the front-end of the idb project. It interesting going back to totally static html, its something I haven't done it quite some time. I have been using angular and vuejs for sometime now but I haven't used facebooks React before for frontend. I started going to MAD's advanced web where they are going to be teaching React to hopefully catch myself up to where I am with other frameworks."
                },
                {
                    "title": "What's in your way?",
                    "body": "Really nothing is in my way right now!"
                },
                {
                    "title": "What will you do next week?",
                    "body": "This next week I have an Information Retrieval project I will be working on. I will also be working to finish up the idb project. We need to work on our documentation write up and finish all of the front-end. Right now we have a lot of the 'infastructure' for the site working and just need to put in the sample data to show it off."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "The class has been good so far, I am really enjoying learning more about python in lecture. The project is a bit sporadic. I feel like the requirements are all over the place and unclear in a lot of ways. While we were working in the lab today we had another group come up and ask us stuff about the project. They asked how we set up react and the database, we however were certain neither of those things were required for the first project and told them such. We later were told by another group that we did need to use react for part 1 of idb. After posting on Piazza, we found out this was not the case and told that group as well. The fact that 3 groups had different ideas about what part 1 was speaks to the layout of this project. Doing a static site first with fake data, but not requiring react, which will later be an integral part is strange which is why I believe it was so unclear. The layout of a site using a component based framework is VASTLY different than a static HTML only site. We are going to have to spend many man hours just reworking our site and componetizing parts before we can move on in the next project. I feel as though this project should have started with us getting a simple one page HTML site up and running using flask and Google Cloud Platform. Something as simple as the team name and photos. Then the next project should have been building out the API and model structure of the site. After fully understanding the data layout of the project we could properly design the site and componetize the application, so the third project could be building out the front-end with React. This layout of this project makes far more sense to me from my experience as a web developer. An MVP shouldn't be so different from the final form that it is almost unusable or requiring manual effort to copy and past html into React components. I am really excited for this project but the cluttered structure has made many of the parts feel confusing or 'for the sake of doing them' and not actually teaching us something about development."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip of the week is to 'reinvent the wheel' as often as you can! Many people talk about this as if it is a bad thing or a waste of time. However as students and upcoming developers I believe it is our duty to try to copy or recreate the things we use to develop, so that we can truly understand why they do things the way they do or how they work. You aren't trying to compete with the thing you are using or replace it for yourself, you simply are breaking it down so far that you can truly understand it."
                }
            ]
        },
        {
            "id": "09172017",
            "title": "Week 3",
            "subtitle": "Looking For a Job",
            "date": "September 17, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week was the career fair! Both an exciting and extremely stressful time of the year. I attended for about 3.5 hours and talked to quite a few companies there, as well as hung out at the companies table that I worked at this past summer talking to students. The career fair really overshadowed everything else that happened."
                },
                {
                    "title": "What's in your way?",
                    "body": "During this time of year I find that the waiting for responses from recruiters and doing coding challenges gets in my way of school. I spend a lot of time thinking/working on stuff around recruiting that I get distracted away from my work."
                },
                {
                    "title": "What will you do next week?",
                    "body": "Next week school is fairly normal, however I did get an interview with Indeed while at the career fair. So monday and tuesday will be prepping/doing the interview and then the rest of the week will be spent anxiously waiting for responses from them and others."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "With the first project behind us feeling like logistical work, I am excited to get started on the big project in the class. I am enjoying learning alot of Python fundamentals deeper than I had understood them before. I am already applying alot of what we are learning in Python to my interview practice as I tend to do interview questions in Python already."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "Why tip of the week is to do lots of practicing for interviews. Whether its for the best or not the way our current recruiting system works favors those who practice one-off style algo and data structures problems. The more of these problems you do the better mindset you are in to tackle these types of complex bite-sized problems. I find that working or personal projects (the type of development most of us will do after school) doesn't lend itself to performing well in interviews so we need to supplement this with extra practice. Good luck to everyone going into interviews!!"
                }
            ]
        },
        {
            "id": "09102017",
            "title": "Week 2",
            "subtitle": "The Work Begins",
            "date": "September 10, 2017",
            "content": [
                {
                    "title": "What did you do this past week?",
                    "body": "This past week I spent my time doing readings for classes, starting to work on collatz, and working on personal projects. Class is just getting started so the work load for everything is still pretty light, so I still have lots of time to work on my own development projects. I have also been working on getting my org ready for the semester and recruiting. I became the president of Design Collective this semester so that has taken up more time than my classes this week."
                },
                {
                    "title": "What's in your way?",
                    "body": "Currently the only thing in my way is the mindset I had over the summer. When working I had a consistent schedule and lots of free time, since all of my work got done during the day. So right now moving away from programming my own things whenever I am free or playing games with my roommates and remembering all of the things I need to do for school is sort of a blocker, mentally."
                },
                {
                    "title": "What will you do next week?",
                    "body": "Next week I will spend a lot of time working on collatz and making sure it is all up to spec, and checking all of the boxes. I have other homework that mostly involves reading for all of my classes so continuing to do that will be a common part of everyweek."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "Overall I am excited for the class this semester. Right now its a bit dry since I took OOP and this project is the same as our starter project in that class. However after working this summer my thoughts around all of the scaffolding in the project have changed. When working on stories for work we go through the process of  estimating time, assigning champions to task them out, and giving them story points. In this class the process is quite different than in the workplace, its far more granular. If implementing a feature that found the max cycle length of a number the story would be more like this: Collatz would have a story point value of difficulty, probably a 1 - 3 just given where I worked. Then the story would have a simple description of the functionality and a set of 'acceptance criteria' to let you know the type of output it would have when finished. Then the champion would create subtasks which would be similar to our issues but more general; 1. Set up repository and CI  2. Write unit and acceptance tests  3. Implement logic  4. Manual testing (if necessary)  5. Code review  6. Deploy. The act of writing out a minimum of 15 issues is tedious and often ends up with the developer creating things simply for the sake of the task. I think the problem may be in that this project is supposed to simulate what an entire 'product' would look like when it is more the workload of a light story so coming up with all the subtasks seems extraneous. However the practice for anyone who has never had any experience doing something like this is better than nothing, it certainly taught me better in OOP. However I feel like the granularity of these projects pull people away from taking the skill into their own projects, and will end up with them worrying too much doing it wrong later in their career. I look forward to it in the web application though, however as that will be much more similar to a 'product'"
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "Contributing to open source is extremely valuable, but can be really scary to students or feel overwhelming. My tip (and sort of self promotion) is to find people similar to your age or position in life working on projects and help out with those. Working on open source doesn't always have to mean workin on some big product, finding a small, maybe less 'important' project can help get you started. Even similar to this is to be the catalyst to creating small projects, when you work on a project make it open source! Typically this is as easy as ensuring the code is on github and writing documentation on what you are doing. This is something I have been trying to do with all of my hobby projects, I am currently working on a small css-framework called KentCSS that I have open and avaliable to the public. I write documentation on the classes and am working on submission guidelines and tips to help people work on it if they find it interesting. Open source is more of an idea than a set of projects, help promote the culture of open source through all of your development!"
                }
            ]
        },
        {
            "id": "09042017",
            "title": "Week 1",
            "subtitle": "Beginning of the End",
            "date": "September 4, 2017",
            "content": [
                {
                    "title": "What are your expectations of the class?",
                    "body": "As the first week of class has finished it is really starting to hit me that I am in my final year. Having now been programming for 3 years my main goal for taking SWE is to solidify good practices and proper techniques in my code. I have used many of the technologies or some variant of them through personal projects or internships, but with more practice comes better and better results. I also am looking forward to becoming proficient in python. While I have worked in the language before, I look forward to Downings very in depth look at the language. I know I learned a great deal about C++ in OOP, and I hope to get that deep into Python as well."
                },
                {
                    "title": "What did you do this past week?",
                    "body": "This past week was quite an easy one, every class was introductions, syllbi, and maybe a intro lecture. I did get a good feel of the majority of my classes so I have been working to prepare myself for the routine I will soon be deeply entrenched in."
                },
                {
                    "title": "What's in your way?",
                    "body": "Currently my school life is smooth sailing, so there aren't really any blockers this week. I do have one class that is only on tuesdays, that I for obvious reasons did not attend, so I am still curious to find out how that class will be."
                },
                {
                    "title": "What will you do next week?",
                    "body": "This upcoming week is where things begin to get real. I will start to form real routines and figure out the time scheduling for all of my classes work."
                },
                {
                    "title": "What's my experience of the class?",
                    "body": "I have taken OOP in the past and so SWE feel very familiar. I was dissapointed to see that the groups for the large project will be randomly assigned, as this project was a large reason for taking this class. I get that the random teams is supposed to simulate 'real life' better, but here where a big portion of it is coming up with the idea (unlike a real job where the idea is typically already with the team) I feel like it will stifle the creativity we will have. I think this because I wanted to go in with friends and acquaintances who have similar interests so we could work on something we all know a lot about and therefore be more creative."
                },
                {
                    "title": "What's my pick-of-the-week or tip-of-the-week?",
                    "body": "My tip of the week is to make sure that you are really paying attention to you classes during syllabus week so you can figure out the work load and schedule you will have to keep throughout the semester. Blocking your time early and preparing yourself can make school feel alot less stressful once the work actually begins."
                }
            ]
        }
    ]
}
