{
    "posts": [{
            "id": "tether12",
            "title": "User testing",
            "date": "April 24, 2018",
            "content": "### What I Worked on This Week\nThis week I revamped the profile screen in order to add toggleable user controls. Before the user profile had no spot on for extra buttons, the only spot was where the follow button was on other peoples profiles. However having a button that large would be awkward on your screen just for settings, so after looking at other social media sites I decided to redo the profile so that the follow button was larger and on your profile screen having two buttons one smaller and one larger. I added in the ability to edit your profile and update your information on the larger button but havent created the functionality yet. The smaller button for settings toggles a dropdown to view hidden functionality in the app like logout. After this I got some feedback after it being showed at MADCon of some bugs that were occuring. One very large one I fixed that was causing an exception to pass through when the user went to a specific set of wrong routes due to the app trying to modify a sent payload. I got a couple of other bugs written down like navigation errors in specific states and the want for reloading the feed after writing.\n### What is in My Way\nThis week my Ethical Hacking group presents our hacking project which is big, but should lighten the load a bit of what I have to do for the rest of the semester.\n### What I am Doing Next Week\nNext week the main new feature I want to add is viewing the parent history of a given story on the story view, and besides that going through and fixing some of the bugs that others found while using the app. Hopefully I can get it into even more hands since I was able to learn alot about where problems were that I couldn't find myself."
        },
        {
            "id": "tether11",
            "title": "Big Bugs",
            "date": "April 16, 2018",
            "content": "### What I Worked on This Week\nThis week was a soft week for work on tethered, I have been working a lot of hours on my hacking final project. The only thing I really did this week was fixing a big bug that caused peoples passwords to be overwritten due to an error in how the user models were being updated. Basically when I originally wrote the creation of the user I used the wrong lifecycle hook to hash the password so the method that hashed the passwords was being called again on user updates like following or adding stories. This caused the hash to be hashed (and repeat) making the actual password no longer usable to access the account. Luckily I caught this while there are very few users! I also fixed some dependencies that were found to have known vulnerabilities and updated the project.\n P.S. I forgot to mention that last week I was also able to setup an actual domain, so now the site is live at [https://www.tetheredbeta.com](https://www.tetheredbeta.com) \n### What is in My Way\nSame as has been except with the coming of the end of the semester bigger projects and tests are beginning to pile up. I have been rather sad not to be able to put in as much time on tethered this week, especially since the time I did have was spent chasing down the culprit of that bug.\n### What I am Doing Next Week\nMadCon is coming up this weekend and while I actually wont be able to make it my roommate who has been wanting to make a native iOS version of tethered using my API will be there and is going to show off the website and whatever progress he has made on the app as well. So hopefully although I wont be there to get to see people using it I will be able to get some good feedback from him and still get good exposure with other CS students. In prepping for this I really would like to have user profile controls in place, however I have been saying that for 2 weeks now. Heres to hoping I will be able to find the time amidst my group projects!"
        },
        {
            "id": "tether10",
            "title": "Big Bugs",
            "date": "April 16, 2018",
            "content": "### What I Worked on This Week\nThis week was a soft week for work on tethered, I have been working a lot of hours on my hacking final project. The only thing I really did this week was fixing a big bug that caused peoples passwords to be overwritten due to an error in how the user models were being updated. Basically when I originally wrote the creation of the user I used the wrong lifecycle hook to hash the password so the method that hashed the passwords was being called again on user updates like following or adding stories. This caused the hash to be hashed (and repeat) making the actual password no longer usable to access the account. Luckily I caught this while there are very few users! I also fixed some dependencies that were found to have known vulnerabilities and updated the project.\n P.S. I forgot to mention that last week I was also able to setup an actual domain, so now the site is live at [https://www.tetheredbeta.com](https://www.tetheredbeta.com) \n### What is in My Way\nSame as has been except with the coming of the end of the semester bigger projects and tests are beginning to pile up. I have been rather sad not to be able to put in as much time on tethered this week, especially since the time I did have was spent chasing down the culprit of that bug.\n### What I am Doing Next Week\nMadCon is coming up this weekend and while I actually wont be able to make it my roommate who has been wanting to make a native iOS version of tethered using my API will be there and is going to show off the website and whatever progress he has made on the app as well. So hopefully although I wont be there to get to see people using it I will be able to get some good feedback from him and still get good exposure with other CS students. In prepping for this I really would like to have user profile controls in place, however I have been saying that for 2 weeks now. Heres to hoping I will be able to find the time amidst my group projects!"
        },
        {
            "id": "tether9",
            "title": "Prepping for Show",
            "date": "April 9, 2018",
            "content": "### What I Worked on This Week\nThis week I am mostly doing some cleanup on things that I have noticed since having the site live. I added proper svg icons on the story cards for liking and linking new stories. I cleaned up the backend to have consistent responses and error states and made sure emails and usernames were unique across the userbase. Then I started adding loading states to the application, I added loaders on the home screen and profile screen which had sometimes long blank screens on slower connections and made the app feel broken. I also fixed some bugs that prevented the follow and like buttons from going into their clicked state even though the api requests went through. I also got a spot to showcase Tethered at MadCon this year which I am excited about and is one of the main reasons I want to remove as many of the bugs I can find as possible so we can maybe grab some early users there!\n### What is in My Way\nNow ontop of my normal art and cloud projects I have an Ethical Hacking final project that will be taking up some of my time in the coming weeks.\n### What I am Doing Next Week\nI want to continue to clean up the application so it feels as polished as possible for MadCon, and that includes some feature addition, the main one I want to add is having parent views on the story page I think that will promote reading the stories a lot. And secondly is user controls around the profile so users can logout, update info and so on."
        },
        {
            "id": "tether8",
            "title": "Big Leaps",
            "date": "April 1, 2018",
            "content": "### What I Worked on This Week\nThis week I worked a ton on tether. At the start of the week I added the screen to view the stories and their children which required adding a new route to grab a stories children from the API. I added the route on the API to grab the entire parent story tree for a particular story to finish the post screen so users creating a branch could go back through and look at the story up to that point. I fixed issues with the navbar by moving it to the outside of the router-views so that I wouldn't have to replicate code for other screens and fixed some layout bugs along with that. \nAt this point I had been talking to one of my friends about the hosting possibilites for the frontend and decided to just have the API serve up the frontend as well off of the same URL instead of having them separate and having to deal with CORS issues. I added a route to render the html off of / and changed the routes for the api to have /api/ before them. I also had to add catches to the server that would redirect all non recognized routes to the frontend since I am using vue-router to handle routing on the client side. After deploying I was able to test the website on multiple devices using more browsers (especially mobile) and was able to push up fixes to a couple of bugs that were appearing in the UI. \nOnce I got the deployed version working well I started implementing the 'like' logic for stories which was fairly simple. After using the site I changed profile links to use the username instead of the userid so people would be able to search for friends accounts. Then I added pagination to the story feed and ordered them chronologically. After that I added the ability to follow users. The next change I want to make is create an actual feed that only includes stories from users that the user follows. I am extremely pleased to have the site up and running, I have been messaging friends who I know to enjoy writing and asking around on social media to get a group of beta testers so I can fish out all of the bugs with the site. \nI already have a set of issues of on Github of bugs and features I want implemented and have been keeping on a Github Project kanban board. This has been helping me because I can sort the issues by importance to me so I can keep focus on what to work on next. If you want to check out the live site you can find it at [https://tetheredapp.herokuapp.com](https://tetheredapp.herokuapp.com).\n### What is in My Way\nBasically the same thing as always, other school work never ends, especially after spending so many hours on tethered this past week.\n### What I am Doing Next Week\nThe top issues on my board are implementing the 'feed', adding the full parent view tab to the story-view, adding actual symbols for liking and branching rather than similar ones I found online, and adding loading indicators across the site. That paired with hopefully getting real users to start populating the site with data so I can see where other bugs might appear during real usage, and I will also get other opinions on the most relevant feature additions."
        },
        {
            "id": "tether7",
            "title": "Learning Experiences",
            "date": "Mar 26, 2018",
            "content": "## Learning Experiences\n### What I Worked on This Week\nThis week I was able to talk to one of my friends about authorization and security around the back end of web-apps. This was extremely valuable as I was certainly under some small misconceptions about how things should work. Before I was having the user log in on our forms, sending this data over via POST, verifying the user credentials and then generating a random 32 digit token that was stored on their user in the database that could be used to authorize their requests through the use of BASIC auth. What I didn't realize was that I was using BASIC auth wrong (it turns out that is what is used when the browser gives you the login popup) and usually this is able to store a session token for the user. However we weren't using the built in tokens from BASIC because this isn't what I wanted the site to do. So in a round about way we were just mashing multiple ways of doing authorization together and not getting benefits from any of them. After talking with my friend he told me that we should be using cookies to store the user data as it was more secure than HTML5 localstorage for storing tokens and that our tokens should be hashes of values and a secret key that only the backend knows about. So I spent this week rewriting the authorization to use JSON Web Tokens which create a Hash based on a object and a server secret key which is stored as an environment variable and is a random 64 digit string. These tokens now have the users information encoded into them so that only they can be used to authorize for that user. The benefit of cookies is that they site specific cookies are passed with the requests made by the user so there is no need to write code on the frontend to pass tokens back and forth. Over all the authorization feels more elegant and robust now and I feel as if I learned quite a bit from the experience of writing it myself. I also added a couple of new routes on the backend that I needed for screens on the front. The ability to be able to get all children of a story and the ability to get the entire parent set of stories allow for the write and story screen to be populated with a single request. Also, after fixing the auth and patching the holes I got the backend hosted with Heroku, which is live at https://tetherapi.herokuapp.com/. If you go to /stories on the API you can see the simple data I have put in for testing!\n### What is in My Way\nWith Easter coming up I will be heading home on Friday to spend the weekend with my family so this weekend will not produce much work. I also have a Cloud Computing project due this weekend that will be butting heads with moving forward on Tether.\n### What I am Doing Next Week\nI did not do what I thought I was going to this past week, but with the backend shored up the only thing I can do is work on the frontend. Now that the API is hosted and live all the time testing with better data will help development on the front. Being able to see how things will actually be gives me more confidence that what I am doing is right. Right now I am feeling pretty good that there will be prototype up and running before that end of the semester and that I could even begin to add things on my 'v2' wishlist."
        },
        {
            "id": "tether6",
            "title": "Spring Break & Midterms",
            "date": "Mar 20, 2018",
            "content": "## A small break\n### What I Worked on This Week\nDue to midterms and travel over the last two weeks I certainly got less done that I would have liked. I reworked all of the current UI to work better on desktops. This meant going back through and adding CSS for each page. I have also been working on the leftover screens, the story view page and the profile page. One of the complications I have been having is deciding when to use routing to a new page or have something appear as an overlayed UI. I want to do more research on how it is properly done and when and how to pass infomation back and forth between the screens.\n### What is in My Way\nProjects in other classes and a ton of leftover art pieces that I need to complete for my 'drawing for nonmajors' course have been pushing on me. Having spotty internet over spring break to not be able to do more research on the parts I have been working on put me back more than I was expecting.\n### What I am Doing Next Week\nOnce again I need to hook up more of the API to the frontend, this will allow me to work on the UI's with good data so I can really see how things will look once the service is online. I also want to get the backend hosted so we can always have data to populate the front-end. I am looking into doing it on Heroku as that is something I have worked with before. I also want to have my applications flow and layout looked at by one of my friends who works with web alot as well. This is my first time using state-management on a larger application but he has experience with Redux so I want to see if he thinks the way I have things set up is the most optimal. That will give me more confidence in making the final steps forward."
        },
        {
            "id": "tether5",
            "title": "Building the Frontend Pieces",
            "date": "Feb 26, 2018",
            "content": "## Building the Pieces\n### What I Worked on This Week\nThis week I finished the login flow for the frontend. You can now run the api locally alongside the frontend and successfully login a user or create an account. While I was doing this I also made some changes to the backend, mainly changing how the authorization is handled. Before we were passing the username and authorization token back and forth for calls made to the api, but I modified it so that the user now passes their unique _id key given by mongo. This will speed up some lookups for calls that get users or posts from the users since the backend no longer has to search by username. I also finished the screen for posting a story. This screen was quite a challenge because of the dynamic nature I wanted to give it. The user can either have a fullscreen view of writing, or be able to see the parent story that they are working off of and get a smaller two-line typing window. It was a fun frontend task that felt like it pushed my knowledge of creating UI's.\n### What is in My Way\nLast week I had my Ethical Hacking midterm and this week I have a midterm in Cloud Computing so those have been pushing me back on working on Tether a bit.\n### What I am Doing Next Week\nNext week I want to link up more of the api, specifially having the proper posts loaded into the main screen based on the logged in user and having the post screen actually commit the story to the database. After I am done with those things I want to create the profile screen and have that populate with the correct data. Once the stories display, you can post, and you can look at profiles the MVP is done. Once the MVP is finished I want to go into testing and hosting the code. Once its hosted it will be very easy to get beta users that will be able to provide Tether with even better testing."
        },
        {
            "id": "tether4",
            "title": "Developmental Design Prototype",
            "date": "Feb 26, 2018",
            "content": "### Designing the frontend\nThis week I spent time creating static designs of what I want the frontend to eventually look like. After finishing the scaffolding and starting developing the frontend last week I realized I needed a more solid roadmap of what the UI would look like, how the navigation would flow before I could appropriately create some of the screens. This is what I have created so far: [prototype](https://xd.adobe.com/view/397c2d26-61f7-4bc6-9dbb-c1690322ef11)\nThe prototype is static screens but the software I am using (Adobe XD) allows for me to create the navigation so I can begin to get a feel of what using the app will be like. Along these lines this week I want to get this prototype into as many hands as I can. Once I have fine tuned some things I will start to create it with Vue.\nOne of the biggest challenges I think I will face throughout this process is communicating the idea of the story trees. Since each node is (at this point) containing 600 char, using an actual tree diagram would be rather pointless since you could not read any portion of the story. So I need to try to convey the ideas of 'parent' and 'child' throughout the UI. While testing it this week I want to see how much explanation it requires to allow people to understand that distiction or if it they will grasp it on their own. This could cause me to need a 'tutorial' esque screen on sign-up if the ideas are not fully clear, or a change in the UI.\nI also wanted to mention that these designs are mobile, as I am designing the website mobile first. The desktop screens will not be too drastically changed but allow for better viewing (larger fonts and padding). Since the size of the story portions are small and there is such a high demand for phone based applications  I believe that the application will perform better upon completion if the mobile experience is of very high quality."
        },
        {
            "id": "tether3",
            "title": "Beginning the Frontend",
            "date": "Feb 19, 2018",
            "content": "### Building out the structure for the frontend\nThis week I spent some time planning and starting building out the application structure for the frontend. I used a tool called 'vue-cli' to help me build out the basic bundling structure for Vue with Webpack. After getting that scaffolding I spent a lot of time learning about a state management tool caled Vuex (based on the principles of Flux and similar to Redux for React). I wanted to use this to be able to handle global events like manipulating screens and being able to have a single source of truth for the login credentials and request logic. I spent some time reading articles about how to best treat AJAX and login in Vue projects and got Vuex setup, hopefully in the best way. After getting the main structure down I started with the main navigation flow. I got a 'fake data' feed of stories and the navigation to and from posting stories done. However none of it is hitting the API yet. My plan for the next week is to finish up the prototypal frontend pieces, specifically the login screen and start hooking that up to real requests. Once I can get a user logged in and the authentication tokens remembered pulling stories and posting will be next. Once I have all of those done, login, posting, and reading, I want to spend sometime off of development testing it with real users. I want to do this as soon as I have a working version so that I can figure out what could be better and then implement it iteratively and get to the best state possible by the end of the semester.\n"
        },
        {
            "id": "tether2",
            "title": "API Design",
            "date": "Feb 10, 2018",
            "content": "### Finishing up with the design of the API\nThis week I worked on setting up login logic on the back-end. For this project I am using basic auth, so I had to come up with my own system for allowing authorization on requests. The basic design is as such:\n* The user creates an account by giving a username and password\n* The backend salts and hashes that password using the library bcrypt\n- When the user logs-in the backend uses bcrypt to compare the password to the encrypted version in the database\n* If the credentials are correct the backend generates a token that it gives back to the frontend\n* The frontend then uses this token to make requests as the user\nRight now this system isn't perfectly secure, the tokens that the backend uses to 'remember' users are randomly generated, but later on I want to create hashes that are created by using the username and some backend secret code. I have been reading and researching on secure methodology for having 'remember-me' keys like this and creating a hash that is not stored on the backend, but instead a generated key is a better way to go.\nThe state that the API is in will allow me to start working on the frontend soon. My goal for the first state is having a homescreen that shows all of the stories in the database. Then a login flow that a user can login with, and once they are logged in, be able to post stories to the database and see a profile that shows their stories.\n### Tools Roadmap\nFor the back and frontend I am using the ExpressJS web framework. For testing the backend I have been using Postman. I want to implement unit tests with Mocha on the backend. For the frontend I am using Vue to create the UI. The plan right now is to use a tool called Karma for testing on the frontend. Once the site is in an MVP state I will host both the API and frontend on AWS as I am taking cloud computing right now which focuses a lot on AWS."
        },
        {
            "id": "tether1",
            "title": "Humble Beginnings",
            "date": "Feb 1, 2018",
            "content": "### Getting started on my BDP creative project\nNow that I have finally officially got my BDP project approved I am getting started on my project 'TETHER'. Well, what is Tether? (name probably wont stick forever, but thats what the products development name will continue to be) Tether is aiming to be the first social platform for writers, giving creative writers a place to practice and interact with others in their field. The premise is based on community story telling, certainly not a new idea it is something we do as kids, when we participate in while in writing courses, or even when we play games like D&D. But how can we manage to bring this idea into the modern age, to close the distance required for people to participate in this kind of interactive experience? With Tether users will be able to create 'story nodes' which are basically bite-sized pieces of a story (probably something from 500-800 characters) then peers are able to create 'branches' off of their node and add onto the story. Users can branch off of any node as many times as they want allowing for endless possibilities for these stories. There's alot to that, so I want to talk about some of the technical details and the roadmap I have ahead of me.\n#### Technical Roadmap\nFor this project I am going to be building a node.js backend using express with MongoDB for persistence (and the mongoose library for interfacing with JS). This is the first road block to tackle and I have already started on it [(**TetherApi**)](https://github.com/Jaredk3nt/tetherApi). I chose these due to my familiarity with javascript, and familiarity with JSON rather than using SQL datastores. Currently I am almost done with a initial version of the API, it needs some more tweaking and testing (and unit testing), but as soon as that is done I will begin on what will be the larger portion of the project, the frontend. The basic idea for the site is simple enough. Modeling trees in the code and storing them in the database was quite simple, however displaying such information to a user will be much more difficult. I will be using a framework called VueJS which I have prior experience with (such as creating this website) to speed up the process of creating the frontend, however everything else I intend to do myself. Since my BDP certificate is in digital art (and my passion lies there as well) I take alot of pride in my ability to design interfaces from scratch. I will be creating a CSS framework as well as a toolset of modular Vue components for Tether to help in streamlining the overall build process by front loading a bit more work at the start. I really want the site to be designed well from the start using a proper atomic structure. That is that every part of the website is build from very small components called 'atoms', that make up bigger components called 'molecules' and so on until the whole site is complete. This will make it easier to make changes to the site, which will be very important to me as I am intending to do user research on the interfaces. Getting early versions into peoples hands will help me to eliminate my own biases and root out core problems early on in the development. I have already been working on mockups and getting feedback on them and hope that this will make my early prototypes go much smoother.\n### Conclusion\nI have a simple road-map that I can make more granular as I approach each phase. My current goal is to have the API hosted and running in the next week or two so that I can have a good base with which to test the frontend. I do have much less experience in creating API's so I am giving myself a little bit of leeway. However, once I start the front-end I hope to have a working prototype version up in about two weeks and have a cycle of user-testing, issue creating, and design iteration going until the end of the semester. Once I have the frontend repository up I will keeping track of issues using Github to keep me on track and focused on the most important tasks.\n **Wish me luck!**"
        },
        {
            "id": "markdown",
            "title": "Testing out my new tool, MarkyJS",
            "date": "January 22, 2018",
            "content": "### My first blog post with markdown\nI finally got around to implementing my own markdown parser, so now my blogposts are fully customizable with markdown! When I was in SWE I set up this blog in a couple of hours so I cut some corners. I only had plain text that could be put into HTML tags. Since we had to have section titles I built a very strictly formatted JSON file that allowed me to have section titles and my component would go through the array of section titles and text and create an unordered list out of them, styling them the correct way. This made it extremely hard to change up the format and basically made it so the blog could never be used for anything else. So a couple of days over the winter break to make **Markyjs** a simple markdown to HTML parser. Now all I have to do is include that as a dependency and then pass the markdown styled string I have stored for the blog post to marky `marky('some markdown here')` and voila!\n\nIt was a fun little project and now I am looking forward to my very very big project this semester that I shall be starting shortly!"
        }
    ]
}