{
    "09042017": {
        "title": "CS373 Fall 2017: Jared Jones - Week 1",
        "content": "\tAs the first week of class has finished it is really starting to hit me that I am in my final year. Having now been programming for 3 years my main goal for taking SWE is to solidify good practices and proper techniques in my code. I have used many of the technologies or some variant of them through personal projects or internships, but with more practice comes better and better results. I also am looking forward to becoming proficient in python. While I have worked in the language before, I look forward to Downings very in depth look at the language. I know I learned a great deal about C++ in OOP, and I hope to get that deep into Python as well.\n\n\tThis past week was quite an easy one, every class was introductions, syllib, and maybe a intro lecture. I did get a good feel of the majority of my classes so I have been working to prepare myself for the routine I will soon be deeply entrenched in.\n\n\tCurrently my school life is smooth sailing, so there aren't really any blockers this week. I do have one class that is only on tuesdays, that I for obvious reasons did not attend, so I am still curious to find out how that class will be.\n\n\tThis upcoming week is where things begin to get real. I will start to form real routines and figure out the time scheduling for all of my classes work.\n\n\tI have taken OOP in the past and so SWE feel very familiar. I was dissapointed to see that the groups for the large project will be randomly assigned, as this project was a large reason for taking this class. I get that the random teams is supposed to simulate 'real life' better, but here where a big portion of it is coming up with the idea (unlike a real job where the idea is typically already with the team) I feel like it will stifle the creativity we will have. I think this because I wanted to go in with friends and acquaintances who have similar interests so we could work on something we all know a lot about and therefore be more creative.\n\n\tMy tip of the week is to make sure that you are really paying attention to you classes during syllabus week so you can figure out the work load and schedule you will have to keep throughout the semester. Blocking your time early and preparing yourself can make school feel alot less stressful once the work actually begins."
    }
}
